In [ ]:
# 6장 시작
!cat /content/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [ ]:
import pandas as pd
df=pd.read_csv('/content/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
pd.read_table('/content/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
!cat /content/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [ ]:
pd.read_csv('/content/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [ ]:
pd.read_csv('/content/ex2.csv', names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
names = ['a','b','c','d','message']
pd.read_csv('/content/ex2.csv', names = names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [ ]:
!cat /content/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [ ]:
parsed = pd.read_csv('/content/csv_mindex.csv',index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [ ]:
list(open('/content/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [ ]:
result = pd.read_table('/content/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [ ]:
!cat /content/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [ ]:
pd.read_csv('/content/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
!cat /content/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [ ]:
result = pd.read_csv('/content/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [ ]:
result = pd.read_csv('/content/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
sentinels = {'message':['foo', 'NA'], 'something':['two']}
pd.read_csv('/content/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [ ]:
pd.options.display.max_rows = 10

In [ ]:
result = pd.read_csv('/content/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [ ]:
pd.read_csv('/content/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [ ]:
chunker = pd.read_csv('/content/ex5.csv', chunksize=1000)
chunker

In [ ]:
chunker = pd.read_csv('/content/ex6.csv', chunksize = 1000)

tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

In [ ]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [ ]:
print(chunker)

<pandas.io.parsers.TextFileReader object at 0x7faf8123c450>

In [ ]:
data = pd.read_csv('/content/ex5.csv')

In [ ]:
data.to_csv('/content/out.csv')

In [ ]:
!cat /content/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [ ]:
import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [ ]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [ ]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [ ]:
data.to_csv(sys.stdout, index=False, columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [ ]:
dates= pd.date_range('1/1/2000', periods=7)

In [ ]:
import numpy as np
ts = pd.Series(np.arange(7), index=dates)

In [ ]:
ts.to_csv('/content/tseries.csv')

In [ ]:
!cat /content/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [ ]:
!cat /content/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3","4"

In [ ]:
import csv
f = open('/content/ex7.csv')

In [ ]:
reader = csv.reader(f)

In [ ]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [ ]:
with open('/content/ex7.csv') as f:
    lines = list(csv.reader(f))

In [ ]:
header, values = lines[0], lines[1:]

In [ ]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [ ]:
class my_dialect(csv.Dialect):
    lineterminator = '/n'
    delimiter =';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL



reader = csv.reader(f, delimiter = '|')

TypeError: ignored

In [ ]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

NameError: ignored

In [ ]:
import json

result = json.loads(obj)

result

NameError: ignored

In [ ]:
asjson = json.dumps(result)

TypeError: ignored

In [ ]:
siblings = pd.DataFrame(result['siblings'], columns=['name','age'])
siblings

KeyError: ignored

In [ ]:
!cat /content/example.json
[{"a":1, "b":2, "c":3},
 {"a":4, "b":5, "c":6},
 {"a":7, "b":8, "c":9}]

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

[{'a': 1, 'b': 2, 'c': 3}, {'a': 4, 'b': 5, 'c': 6}, {'a': 7, 'b': 8, 'c': 9}]

In [ ]:
import json
data = pd.read_json('/content/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
tables = pd.read_html('/content/fdic_failed_bank_list.html')
len(tables)

1

In [ ]:
failures = tables[0]

In [ ]:
failures.head()

                      Bank Name  ...       Updated Date
0                   Allied Bank  ...  November 17, 2016
1  The Woodbury Banking Company  ...  November 17, 2016
2        First CornerStone Bank  ...  September 6, 2016
3            Trust Company Bank  ...  September 6, 2016
4    North Milwaukee State Bank  ...      June 16, 2016

[5 rows x 7 columns]

In [ ]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [ ]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [ ]:
from lxml import objectify

path = '/content/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [ ]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [ ]:
perf = pd.DataFrame(data)

perf.head()

            AGENCY_NAME  ... MONTHLY_ACTUAL
0  Metro-North Railroad  ...           96.9
1  Metro-North Railroad  ...             95
2  Metro-North Railroad  ...           96.9
3  Metro-North Railroad  ...           98.3
4  Metro-North Railroad  ...           95.8

[5 rows x 12 columns]

In [ ]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [ ]:
root

In [ ]:
root.get('href')

'http://www.google.com'

In [ ]:
root.text

'Google'

In [ ]:
frame = pd.read_csv('/content/ex1.csv')

In [ ]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
frame.to_pickle('/content/frame_pickle')

In [ ]:
pd.read_pickle('/content/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
frame = pd.DataFrame({'a':np.random.randn(100)})

In [ ]:
store = pd.HDFStore('mydata.h5')

In [ ]:
store['obj1'] = frame

In [ ]:
store['obj1_col'] = frame['a']

In [ ]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [ ]:
store['obj1']

           a
0   1.271932
1   1.929264
2   0.660080
3  -0.606637
4   1.113837
..       ...
95 -0.587520
96 -1.170594
97 -0.281436
98 -1.154270
99 -0.435090

[100 rows x 1 columns]

In [ ]:
store.put('obj2', frame, format = 'table')

In [ ]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.640954
11  0.458000
12 -0.412712
13  0.135481
14  1.385127
15  1.366346

In [ ]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [ ]:
pd.read_hdf('mydata.h5', 'obj3', where=['index >= 10 and index <= 15'])

ValueError: ignored

In [ ]:
xlsx = pd.ExcelFile('/content/ex1.xlsx')

In [ ]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [ ]:
frame = pd.read_excel('/content/ex1.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [ ]:
writer = pd.ExcelWriter('/content/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

In [ ]:
frame.to_excel('/content/ex2.xlsx')

In [ ]:
import requests

In [ ]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [ ]:
resp = requests.get(url)

In [ ]:
resp

In [ ]:
data = resp.json()

In [ ]:
data['title']

TypeError: ignored

In [ ]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [ ]:
issues

    number  ... state
0    41534  ...  open
1    41533  ...  open
2    41532  ...  open
3    41531  ...  open
4    41530  ...  open
..     ...  ...   ...
25   41501  ...  open
26   41500  ...  open
27   41497  ...  open
28   41496  ...  open
29   41495  ...  open

[30 rows x 4 columns]

In [ ]:
import sqlite3
query = """CREATE TABLE test (a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)

In [ ]:
con.commit()

In [ ]:
data = [('Atlanta','Georgia',1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [ ]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"
con.executemany(stmt, data)

In [ ]:
con.commit()

In [ ]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()

In [ ]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [ ]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [ ]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [ ]:
import sqlalchemy as sqla

In [ ]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [ ]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [ ]:
# 7장 데이터 정제 및 준비
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [ ]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [ ]:
string_data[0] = None

In [ ]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [ ]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA,NA,NA],[NA,6.5,3.]])

In [ ]:
cleaned = data.dropna()

In [ ]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [ ]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [ ]:
data.dropna(axis = 1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [ ]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.367088       NaN       NaN
1  0.037740       NaN       NaN
2 -1.292806       NaN -0.303109
3 -0.241446       NaN  0.529737
4 -0.826611  0.674807 -0.138909
5 -0.670504  0.281343  0.865250
6  0.824174 -0.335635  1.054040

In [ ]:
df.dropna()

          0         1         2
4 -0.826611  0.674807 -0.138909
5 -0.670504  0.281343  0.865250
6  0.824174 -0.335635  1.054040

In [ ]:
df.dropna(thresh=2)

          0         1         2
2 -1.292806       NaN -0.303109
3 -0.241446       NaN  0.529737
4 -0.826611  0.674807 -0.138909
5 -0.670504  0.281343  0.865250
6  0.824174 -0.335635  1.054040

In [ ]:
df.fillna(0)

          0         1         2
0  1.367088  0.000000  0.000000
1  0.037740  0.000000  0.000000
2 -1.292806  0.000000 -0.303109
3 -0.241446  0.000000  0.529737
4 -0.826611  0.674807 -0.138909
5 -0.670504  0.281343  0.865250
6  0.824174 -0.335635  1.054040

In [ ]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  1.367088  0.500000  0.000000
1  0.037740  0.500000  0.000000
2 -1.292806  0.500000 -0.303109
3 -0.241446  0.500000  0.529737
4 -0.826611  0.674807 -0.138909
5 -0.670504  0.281343  0.865250
6  0.824174 -0.335635  1.054040

In [ ]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  1.367088  0.000000  0.000000
1  0.037740  0.000000  0.000000
2 -1.292806  0.000000 -0.303109
3 -0.241446  0.000000  0.529737
4 -0.826611  0.674807 -0.138909
5 -0.670504  0.281343  0.865250
6  0.824174 -0.335635  1.054040

In [ ]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  1.649775 -1.942753  0.823154
1 -0.109740 -1.591220 -0.460899
2  1.647964       NaN -0.768251
3 -0.493314       NaN -0.077484
4 -0.278021       NaN       NaN
5  0.291854       NaN       NaN

In [ ]:
df.fillna(method='ffill')

          0         1         2
0  1.649775 -1.942753  0.823154
1 -0.109740 -1.591220 -0.460899
2  1.647964 -1.591220 -0.768251
3 -0.493314 -1.591220 -0.077484
4 -0.278021 -1.591220 -0.077484
5  0.291854 -1.591220 -0.077484

In [ ]:
df.fillna(method = 'ffill', limit=2)

          0         1         2
0  1.649775 -1.942753  0.823154
1 -0.109740 -1.591220 -0.460899
2  1.647964 -1.591220 -0.768251
3 -0.493314 -1.591220 -0.077484
4 -0.278021       NaN -0.077484
5  0.291854       NaN -0.077484

In [ ]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [ ]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 +['two'],
                     'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [ ]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [ ]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [ ]:
data['v1'] = range(7)

In [ ]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [ ]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [ ]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [ ]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [ ]:
lowercased = data['food'].str.lower()

In [ ]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [ ]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [ ]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [ ]:
data = pd.Series([1., -999., 2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [ ]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [ ]:
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [ ]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index = ['Ohio', 'Colorado', 'New York'],
                    columns =['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [ ]:
transform = lambda x: x[:4].upper()

In [ ]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [ ]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [ ]:
data.rename(index = str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [ ]:
data.rename(index = {'OHIO':'INDIANA'},
            columns ={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [ ]:
data.rename(index = {'OHIO':'INDIANA'},inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [ ]:
ages= [20,22,25,27,21,23,37,31,61,45,41,32]

In [ ]:
bins = [18,25,35,60,100]

In [ ]:
cats = pd.cut(ages, bins)

In [ ]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [ ]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [ ]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [ ]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
pd.cut(ages, [18,26,36,61,100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [ ]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [ ]:
pd.cut(ages, bins, labels = group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [ ]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.28, 0.51], (0.053, 0.28], (0.51, 0.74], (0.28, 0.51], (0.053, 0.28], ..., (0.74, 0.97], (0.51, 0.74], (0.74, 0.97], (0.28, 0.51], (0.51, 0.74]]
Length: 20
Categories (4, interval[float64]): [(0.053, 0.28] < (0.28, 0.51] < (0.51, 0.74] < (0.74, 0.97]]

In [ ]:
data = np.random.randn(1000) # 정규 분포

In [ ]:
cats = pd.qcut(data, 4) # 4분위로 분류
cats

[(-0.612, -0.00327], (-3.36, -0.612], (0.687, 2.952], (-0.00327, 0.687], (-0.612, -0.00327], ..., (-0.612, -0.00327], (0.687, 2.952], (-0.00327, 0.687], (-3.36, -0.612], (0.687, 2.952]]
Length: 1000
Categories (4, interval[float64]): [(-3.36, -0.612] < (-0.612, -0.00327] < (-0.00327, 0.687] <
                                    (0.687, 2.952]]

In [ ]:
pd.value_counts(cats)

(0.687, 2.952]        250
(-0.00327, 0.687]     250
(-0.612, -0.00327]    250
(-3.36, -0.612]       250
dtype: int64

In [ ]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.212, -0.00327], (-1.212, -0.00327], (-0.00327, 1.26], (-0.00327, 1.26], (-1.212, -0.00327], ..., (-1.212, -0.00327], (-0.00327, 1.26], (-0.00327, 1.26], (-1.212, -0.00327], (-0.00327, 1.26]]
Length: 1000
Categories (4, interval[float64]): [(-3.36, -1.212] < (-1.212, -0.00327] < (-0.00327, 1.26] <
                                    (1.26, 2.952]]

In [ ]:
data = pd.DataFrame(np.random.randn(1000,4))

In [ ]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.004910    -0.054453    -0.070218    -0.021844
std       0.984227     1.008200     1.011017     1.020403
min      -3.087165    -2.996989    -3.014841    -3.353295
25%      -0.693135    -0.725676    -0.716030    -0.714731
50%       0.013629    -0.058064    -0.020139    -0.014313
75%       0.652164     0.589823     0.547206     0.664542
max       2.785219     3.144179     3.259342     3.558627

In [ ]:
col = data[2]

In [ ]:
col[np.abs(col) > 3]

129    3.040232
812   -3.014841
932    3.259342
Name: 2, dtype: float64

In [ ]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
29   0.209226 -0.146704 -1.277684 -3.353295
129  1.071222 -0.072278  3.040232 -0.331864
284 -0.660523  0.750656 -1.838685 -3.270164
377 -1.006688  1.314923  0.514514  3.558627
490 -3.087165  1.037305 -2.260843 -0.758905
812 -0.376135  1.333568 -3.014841 -0.695891
875 -0.584254  3.144179 -0.541479 -0.635264
932 -0.040195  0.054403  3.259342  0.749982

In [ ]:
data[np.abs(data)>3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.004822    -0.054597    -0.070502    -0.021779
std       0.983957     1.007752     1.010028     1.016669
min      -3.000000    -2.996989    -3.000000    -3.000000
25%      -0.693135    -0.725676    -0.716030    -0.714731
50%       0.013629    -0.058064    -0.020139    -0.014313
75%       0.652164     0.589823     0.547206     0.664542
max       2.785219     3.000000     3.000000     3.000000

In [ ]:
data[(np.abs(data)>=3).any(1)]

            0         1         2         3
29   0.209226 -0.146704 -1.277684 -3.000000
129  1.071222 -0.072278  3.000000 -0.331864
284 -0.660523  0.750656 -1.838685 -3.000000
377 -1.006688  1.314923  0.514514  3.000000
490 -3.000000  1.037305 -2.260843 -0.758905
812 -0.376135  1.333568 -3.000000 -0.695891
875 -0.584254  3.000000 -0.541479 -0.635264
932 -0.040195  0.054403  3.000000  0.749982

In [ ]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1  1.0  1.0 -1.0  1.0
2 -1.0 -1.0  1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4 -1.0  1.0  1.0 -1.0

In [ ]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler = np.random.permutation(5)

In [ ]:
sampler

array([2, 1, 3, 0, 4])

In [ ]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [ ]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [ ]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19

In [ ]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10, replace=True)
draws

2   -1
0    5
3    6
1    7
1    7
4    4
4    4
4    4
0    5
3    6
dtype: int64

In [ ]:
df = pd.DataFrame({'key': ['b','b','a','c','a','b'],'data1': range(6)})

pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [ ]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [ ]:
mnames = ['movie_id','title','genres']
movies = pd.read_table('/movies.dat', sep='::', header=None, names=mnames)
movies[:10]

/usr/local/lib/python3.7/dist-packages/pandas/io/parsers.py:767: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return read_csv(**locals())

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [ ]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))

genres = pd.unique(all_genres)

In [ ]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [ ]:
zero_matrix = np.zeros((len(movies), len(genres)))

dummies = pd.DataFrame(zero_matrix, columns=genres)

In [ ]:
gen = movies.genres[0]

In [ ]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [ ]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [ ]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [ ]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [ ]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [ ]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [ ]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [4]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [5]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [6]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [7]:
'::'.join(pieces)

'a::b::guido'

In [8]:
'guido' in val

True

In [9]:
val.index(',')

1

In [10]:
val

'a,b, guido'

In [13]:
val.find(':')

-1

In [14]:
val.index(':')

ValueError: ignored

In [16]:
val.count(',')

2

In [17]:
val.replace(',', '::')

'a::b:: guido'

In [18]:
val.replace(',','')

'ab guido'

In [25]:
import re

text = "foo bar\t baz \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [27]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [28]:
regex.findall(text)

[' ', '\t ', ' \t']

In [36]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

regex = re.compile(pattern, flags=re.IGNORECASE)

regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [37]:
m = regex.search(text)

In [38]:
m

In [40]:
text[m.start():m.end()]

'dave@google.com'

In [41]:
print(regex.match(text))

None

In [43]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [50]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [52]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright')

In [51]:
regex.findall(text)

[('dave', 'google'), ('steve', 'gmail'), ('rob', 'gmail'), ('ryan', 'yahoo')]

In [55]:
print(regex.sub(r'Username : \1, Domain: \2, Suffix: \3', text))

error: ignored

In [59]:
import numpy as np
import pandas as pd

data = {'Dave':'dave@google.com', 'Steve':'steve@gmail.com','Rob':'rob@gmail.com', 'Wes': np.nan}
data= pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [60]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [61]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [62]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.[A-Z]{2,4}'

In [68]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google)]
Steve    [(steve, gmail)]
Rob        [(rob, gmail)]
Wes                   NaN
dtype: object

In [76]:
matches = data.str.match(pattern, flags = re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [78]:
matches.str.get(1)

AttributeError: ignored

In [74]:
matches.str[0]

AttributeError: ignored

In [75]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object